package by.htp.lsn;

public class Task8 {

	public static void main(String[] args) {
		// Дан массив A вещественного типа, содержащий 20 положительных и отрицательных элементов. 
		//Сформировать массив B из положительных элементов массива A, имеющих четный индекс. 
		//Найти сумму квадратов элементов нового массива.
		
		double [] mas1 = new double [20];
		double [] mas2 = new double [10];
		
				
		for (int i = 0; i < mas1.length; i++) {
			mas1[i] = (double) Math.floor(Math.random()*20-10);
			
			
				if (mas1[2] > 0);
				mas2[i] = mas1[2];
			
			
			System.out.print(mas1[i] + "  ");

	}
			System.out.print(mas2[i] + "  ");
				
			}
	}


